In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [2]:
connection = "mysql+pymysql://root:#Lover4life@localhost/imdb_data"
engine = create_engine(connection)

In [3]:
#Use glob to append data
q = "Data/final_tmdb_data_*.csv.gz"
files = glob.glob(q)
files

['Data/final_tmdb_data_2018.csv.gz',
 'Data/final_tmdb_data_2014.csv.gz',
 'Data/final_tmdb_data_2016.csv.gz',
 'Data/final_tmdb_data_2020.csv.gz',
 'Data/final_tmdb_data_2000.csv.gz',
 'Data/final_tmdb_data_2012.csv.gz',
 'Data/final_tmdb_data_2019.csv.gz',
 'Data/final_tmdb_data_2015.csv.gz',
 'Data/final_tmdb_data_2021.csv.gz',
 'Data/final_tmdb_data_2017.csv.gz',
 'Data/final_tmdb_data_2001.csv.gz',
 'Data/final_tmdb_data_2013.csv.gz']

In [7]:
## Loading all files as df and appending to a list
df_list = []
for file in files:
    print(file)
    temp_df = pd.read_csv(file,usecols=['imdb_id','revenue','budget',], lineterminator='\n')
    df_list.append(temp_df)
    #,usecols=['imdb_id','revenue','budget','certification']
## Concatenating the list of dfs into 1 combined
tmdb_data = pd.concat(df_list)

Data/final_tmdb_data_2018.csv.gz
Data/final_tmdb_data_2014.csv.gz
Data/final_tmdb_data_2016.csv.gz
Data/final_tmdb_data_2020.csv.gz
Data/final_tmdb_data_2000.csv.gz
Data/final_tmdb_data_2012.csv.gz
Data/final_tmdb_data_2019.csv.gz
Data/final_tmdb_data_2015.csv.gz
Data/final_tmdb_data_2021.csv.gz
Data/final_tmdb_data_2017.csv.gz
Data/final_tmdb_data_2001.csv.gz
Data/final_tmdb_data_2013.csv.gz

In [8]:
tmdb_data

        imdb_id      budget  revenue
0             0         NaN      NaN
1     tt0069049  12000000.0      0.0
2     tt0192528   5000000.0      0.0
3     tt0360556         0.0      0.0
4     tt0365545         0.0      0.0
...         ...         ...      ...
3448  tt8159944         0.0      0.0
3449  tt8653804         0.0      0.0
3450  tt8728782         0.0      0.0
3451  tt9278070         0.0      0.0
3452  tt9546080         0.0      0.0

[42762 rows x 3 columns]

In [9]:
tmdb_data.rename(columns={'imdb_id': 'tconst'},inplace=True)
tmdb_data.head()

      tconst      budget  revenue
0          0         NaN      NaN
1  tt0069049  12000000.0      0.0
2  tt0192528   5000000.0      0.0
3  tt0360556         0.0      0.0
4  tt0365545         0.0      0.0

In [10]:
tmdb_data = tmdb_data[tmdb_data.tconst != '0']

In [12]:
## get max string length
key_len = tmdb_data['tconst'].fillna('').map(len).max()

In [13]:
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'budget':Float(),
    'revenue':Float(),}

In [14]:
tmdb_data.drop_duplicates(inplace=True)

/var/folders/3k/j6h125_93dz6sl2cxdygx8gc0000gn/T/ipykernel_3088/3258133511.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb_data.drop_duplicates(inplace=True)

In [15]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data_00s',engine,dtype=df_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE tmdb_data_00s ADD PRIMARY KEY (`tconst`);')

Q1. Does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?

Null Hypothesis: All movies generate the same revenue regardless of the rating.

Alternative Hypothesis: There is a significant difference in revenue based on the rating of a movie.

Alpha = 0.05

ANOVA test

In [16]:
q1 = """SELECT *
FROM tmdb_data
WHERE certification in ('G','PG','PG-13','R');"""
q1_data = pd.read_sql(q1, engine)

In [17]:
# Filtering by rating
G_df = q1_data.loc[q1_data['certification']== 'G'].copy()
PG_df = q1_data.loc[q1_data['certification']== 'PG'].copy()
PG13_df = q1_data.loc[q1_data['certification']== 'PG-13'].copy()
R_df = q1_data.loc[q1_data['certification']== 'R'].copy()

In [18]:
G_weight = G_df['revenue']
PG_weight = PG_df['revenue']
PG13_weight = PG13_df['revenue']
R_weight = R_df['revenue']

In [20]:
# Check for outliers by region
import scipy.stats as stats
zscores= stats.zscore(G_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

zscores= stats.zscore(PG_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

zscores= stats.zscore(PG13_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

zscores= stats.zscore(R_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

1
2
6
12

In [21]:
G_weight = G_weight[(np.abs(stats.zscore(G_weight)) < 3)]
PG_weight = PG_weight[(np.abs(stats.zscore(PG_weight)) < 3)]
PG13_weight = PG13_weight[(np.abs(stats.zscore(PG13_weight)) < 3)]
R_weight = R_weight[(np.abs(stats.zscore(R_weight)) < 3)]

In [22]:
## Create groups dictionary.  
groups = {}
## Loop through all unique categories
for i in q1_data['certification'].unique():
    ## Get series for group and rename
    data = q1_data.loc[q1_data['certification']==i,'revenue'].copy()
    
    # save into the dictionary
    groups[i] = data
groups.keys()

dict_keys(['PG-13', 'R', 'PG', 'G'])

In [23]:
## Running normal test on each group and confirming there are >20 in each group
norm_results = {}
for i, data in groups.items():
    stat, p = stats.normaltest(data)
    ## save the p val, test statistic, and the size of the group
    norm_results[i] = {'n': len(data),
                             'p':p,
                             'test stat':stat,}
## convert to a dataframe
norm_results_df = pd.DataFrame(norm_results).T
norm_results_df

           n              p   test stat
PG-13  207.0   2.343974e-36  164.082432
R      483.0  8.062976e-111  506.999325
PG      87.0   5.143576e-28  125.669268
G       43.0   3.223306e-15   66.736738

In [24]:
## Testing assumption of equal variance
stats.levene(*groups.values())

LeveneResult(statistic=16.01321658434674, pvalue=4.011591743928171e-10)

Because the p-value is less than alpha of 0.05, we reject the null hypothesis of equal variance.

In [25]:
result = stats.f_oneway( *groups.values())
result

F_onewayResult(statistic=15.89040984671682, pvalue=4.75743481713246e-10)

In [26]:
tukeys_dfs = []

for group_name, group_data in groups.items():
    
        temp_df = pd.DataFrame({'Data':group_data, 'Group':group_name})
        
        tukeys_dfs.append(temp_df)
        
tukeys_data = pd.concat(tukeys_dfs)
tukeys_data

            Data  Group
0     76019000.0  PG-13
1      5271670.0  PG-13
10   871368000.0  PG-13
12   546388000.0  PG-13
14   296340000.0  PG-13
..           ...    ...
794          0.0      G
802          0.0      G
805          0.0      G
813          0.0      G
818          0.0      G

[820 rows x 2 columns]

In [28]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd
## save the values as kg_lost and the labels to the Diet
values = tukeys_data['Data']
labels = tukeys_data['Group']

In [29]:
## perform tukey's multiple comparison test and display the summary
tukeys_results = pairwise_tukeyhsd(values,labels)
tukeys_results.summary()

The significant difference is between PG/R and PG-13/R
according to the turkey test

Q2. Does ratings/review score of a movie affect how much revenue the movie generates?

Null Hypothesis: Rating/Review does not affect the revenue the movie generates

Alternative Hypothesis: Revenue the movie generates is affected by the rating/review

Alpha = 0.05

T-Test

In [57]:
q2 = """SELECT td.revenue, title_ratings.averageRating
FROM tmdb_data as td
LEFT JOIN title_ratings ON td.imdb_id = title_ratings.tconst
WHERE td.revenue >0
"""
q2_data = pd.read_sql(q3, engine)

In [58]:
q2_data

         revenue  averageRating
0    169328000.0            7.4
1     91753200.0            6.4
2    207516000.0            7.6
3     14493300.0            7.4
4     12372400.0            5.3
..           ...            ...
342     148701.0            7.0
343   60874600.0            5.6
344   16176700.0            5.7
345   17423000.0            7.2
346   16154000.0            7.0

[347 rows x 2 columns]

In [60]:
#let's create groups for ratings
q2_data['averageRating'].unique()

array([7.4, 6.4, 7.6, 5.3, 6.3, 6.5, 6.6, 2.5, 5.9, 6.1, 5.5, 5.8, 6.8,
       7. , 4.7, 8.2, 7.3, 6. , 5.7, 7.7, 4.9, 6.7, 4.8, 4.6, 5.2, 7.8,
       6.9, 4.1, 5.6, 5.4, 6.2, 7.5, 8.6, 5.1, 7.2, 7.9, 8.3, 5. , 4.3,
       3.7, 8.1, 2.4, 7.1, 4. , 3.9, 4.4, 8.8, 8.4, 3.6, 3.8, 4.5, 8.5])

In [67]:
group1 = q2_data.loc[(q2_data['averageRating']>=0.0) & (q2_data['averageRating'] <= 6.6),'revenue']
group2 = q2_data.loc[(q2_data['averageRating']>=6.7) & (q2_data['averageRating'] <=10), 'revenue']

In [68]:
#create a dictionary
groups={'group1':group1,
        'group2': group2,
       }
groups.keys()

dict_keys(['group1', 'group2'])

In [69]:
# let's check how much data per genre
length_dict = {key: len(value) for key, value in groups.items()}
sort_genre = pd.DataFrame.from_dict(length_dict, orient='index').sort_values(by=0, ascending=False)
sort_genre.head()

          0
group1  227
group2  120

In [70]:
## Running normal test on each group and confirming there are >20 in each group
norm_results = {}
for i, data in groups.items():
    stat, p = stats.normaltest(data)
    ## save the p val, test statistic, and the size of the group
    norm_results[i] = {'n': len(data),
                             'p':p,
                             'test stat':stat,}
## convert to a dataframe
norm_results_df = pd.DataFrame(norm_results).T
norm_results_df

            n             p   test stat
group1  227.0  1.949743e-30  136.819710
group2  120.0  1.106043e-22  101.112167

In [71]:
## Testing assumption of equal variance
stats.levene(*groups.values())

LeveneResult(statistic=8.229331319790388, pvalue=0.004375633004213027)

P-value is lower than Alpha so we will reject the null hypothesis and accept the alternative hypothesis.

Q3. Do Comedies movies have have shorter runtimes than Comedies?

Null Hypothesis: Drama and Comedies have the same runtimes on average.

Alternative Hypothesis: Comedies have shorter runtimes than Dramas.

Alpha = 0.05

T-Test

In [40]:
q3 = """SELECT g.Genre_Name, tb.runtimeMinutes
FROM title_basics tb JOIN title_genres tg
ON tb.tconst = tg.tconst
JOIN genres g
ON tg.genre_id = g.Genre_ID;"""
q3_data = pd.read_sql(q3, engine)

In [41]:
q3_data

       Genre_Name  runtimeMinutes
0          Comedy             118
1         Fantasy             118
2         Romance             118
3           Drama              70
4           Drama             122
...           ...             ...
171781     Action              95
171782  Adventure              95
171783   Thriller              95
171784      Drama              92
171785    History              92

[171786 rows x 2 columns]

In [42]:
# Filtering for Drama/Comedy
drama_df = q3_data.loc[q3_data['Genre_Name']== 'Drama'].copy()
comedy_df = q3_data.loc[q3_data['Genre_Name']== 'Comedy'].copy()

In [43]:
drama_weight = drama_df['runtimeMinutes']
comedy_weight = comedy_df['runtimeMinutes']

In [44]:
# Check for outliers in both groups
zscores= stats.zscore(drama_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

# Check for outliers in smokers group
zscores= stats.zscore(comedy_weight)
outliers = abs(zscores)>3
print(np.sum(outliers))

333
144

In [45]:
# remove outliers
drama_weight = drama_weight[(np.abs(stats.zscore(drama_weight)) < 3)]
comedy_weight = comedy_weight[(np.abs(stats.zscore(comedy_weight)) < 3)]

In [46]:
# test for normality
result_drama_weight = stats.normaltest(drama_weight)
print(result_drama_weight)

result_comedy_weight = stats.normaltest(comedy_weight)
print(result_comedy_weight)

NormaltestResult(statistic=2140.68171379191, pvalue=0.0)
NormaltestResult(statistic=2089.9112230990427, pvalue=0.0)

In [47]:
# Test for equal variance
result = stats.levene(drama_weight, comedy_weight)
result

LeveneResult(statistic=0.024846184780676725, pvalue=0.8747513663130551)

In [48]:
# Final t-test, after confirming we meet the assumptions
result = stats.ttest_ind(drama_weight, comedy_weight, equal_var = False )
result

Ttest_indResult(statistic=34.549797980419385, pvalue=9.475622666935919e-259)

The p-value is less than our alpha value, so we will reject the null hypothesis, and accept the alternate hypothesis